Ran Plan for 6 projects:

1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal`
---

### 1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com...
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/secret-manager/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/service-connection-policy/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/service-connection-policy/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/service-connection-policy/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com/modules/vpc/variables.tf

07:27:45.793 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:27:46.407 INFO   Downloading Terraform configurations from ../../../../../../../../modules/dns-zone into ./.terragrunt-cache/YPxPpTHI825G6orVr7Q9v8RK4BM/_dMaxM82QOeXIH12CDigfcDxL8U
07:27:46.472 INFO   terraform1.13.3: Initializing the backend...
07:27:47.227 INFO   terraform1.13.3: 
07:27:47.227 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:27:47.227 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:27:47.540 INFO   terraform1.13.3: Initializing provider plugins...
07:27:47.541 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
07:27:47.900 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:27:48.235 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:27:48.235 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:27:48.235 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:27:48.235 INFO   terraform1.13.3: you run "terraform init" in the future.
07:27:48.235 INFO   terraform1.13.3: ╷
07:27:48.235 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:27:48.236 INFO   terraform1.13.3: │ 
07:27:48.236 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:27:48.236 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:27:48.236 INFO   terraform1.13.3: │   - hashicorp/google
07:27:48.236 INFO   terraform1.13.3: │ 
07:27:48.236 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:27:48.236 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:27:48.236 INFO   terraform1.13.3: │ these providers.
07:27:48.236 INFO   terraform1.13.3: │ 
07:27:48.236 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:27:48.236 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:27:48.236 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:27:48.237 INFO   terraform1.13.3: ╵
07:27:48.237 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:27:51.784 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
07:27:51.784 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
07:27:51.785 STDOUT terraform1.13.3:   + create
07:27:51.785 STDOUT terraform1.13.3: Terraform will perform the following actions:
07:27:51.785 STDOUT terraform1.13.3:   # google_dns_managed_zone.zone will be created
07:27:51.785 STDOUT terraform1.13.3:   + resource "google_dns_managed_zone" "zone" {
07:27:51.785 STDOUT terraform1.13.3:       + creation_time    = (known after apply)
07:27:51.785 STDOUT terraform1.13.3:       + description      = "Public DNS zone for stg"
07:27:51.785 STDOUT terraform1.13.3:       + dns_name         = "iac.com."
07:27:51.785 STDOUT terraform1.13.3:       + effective_labels = {
07:27:51.785 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:27:51.785 STDOUT terraform1.13.3:         }
07:27:51.785 STDOUT terraform1.13.3:       + force_destroy    = false
07:27:51.786 STDOUT terraform1.13.3:       + id               = (known after apply)
07:27:51.786 STDOUT terraform1.13.3:       + managed_zone_id  = (known after apply)
07:27:51.786 STDOUT terraform1.13.3:       + name             = "iac-com"
07:27:51.786 STDOUT terraform1.13.3:       + name_servers     = (known after apply)
07:27:51.786 STDOUT terraform1.13.3:       + project          = "iac-01"
07:27:51.786 STDOUT terraform1.13.3:       + terraform_labels = {
07:27:51.786 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:27:51.786 STDOUT terraform1.13.3:         }
07:27:51.786 STDOUT terraform1.13.3:       + visibility       = "public"
07:27:51.786 STDOUT terraform1.13.3:       + cloud_logging_config (known after apply)
07:27:51.787 STDOUT terraform1.13.3:       + dnssec_config (known after apply)
07:27:51.787 STDOUT terraform1.13.3:     }
07:27:51.787 STDOUT terraform1.13.3: Plan: 1 to add, 0 to change, 0 to destroy.
07:27:51.787 STDOUT terraform1.13.3: 
07:27:51.787 STDOUT terraform1.13.3: Changes to Outputs:
07:27:51.787 STDOUT terraform1.13.3:   + dns_name     = "iac.com."
07:27:51.787 STDOUT terraform1.13.3:   + name_servers = (known after apply)
07:27:51.787 STDOUT terraform1.13.3:   + zone_name    = "iac-com"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com -w nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Fglobal%252Fdns-zone%252Fiac-com%252Fnz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com -w nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc...
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/secret-manager/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/service-connection-policy/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/service-connection-policy/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/service
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.